app/views/replies/_choice.html.erb

<div class="radio">
  <% c.object.question.possible_answers.each do |possible_answer| %>
---
SELECT "possible_answers".* FROM "possible_answers" WHERE "possible_answers"."question_id" = ?  [["question_id", 1]]