app/views/polls/show.html.erb

				<ul>
					<% @poll.questions.each do |question| %>
---
SELECT "questions".* FROM "questions" WHERE "questions"."poll_id" = ?  [["poll_id", 1]]

						<ul>
							<% question.possible_answers.each do |possible_answer| %>
---
SELECT "possible_answers".* FROM "possible_answers" WHERE "possible_answers"."question_id" = ?  [["question_id", 1]]

			<h2>Replies</h2>
				<% @poll.replies.each do |reply| %>
---
SELECT "replies".* FROM "replies" WHERE "replies"."poll_id" = ?  [["poll_id", 1]]

								<dl>
								<% reply.answers.each do |answer| %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."reply_id" = ?  [["reply_id", 1]]