app/controllers/polls_controller.rb

SELECT "polls".* FROM "polls"
---
  def index
    @polls = Poll.all

INSERT INTO "polls" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Customer Service Poll"], ["created_at", "2015-11-08 12:17:39.421880"], ["updated_at", "2015-11-08 12:17:39.421880"]]
---
  def create
    @poll = Poll.new(poll_params)

    respond_to do |format|
      if @poll.save

SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_poll
      @poll = Poll.find(params[:id])