app/controllers/questions_controller.rb

  def create
    @question = @poll.questions.build(question_params)

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("title", "kind", "poll_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "What's your fav colour?"], ["kind", "choice"], ["poll_id", 1], ["created_at", "2015-11-08 12:17:53.699051"], ["updated_at", "2015-11-08 12:17:53.699051"]]

    def set_poll
      @poll = Poll.find params[:poll_id]
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", 1]]