app/controllers/replies_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."poll_id" = ?  [["poll_id", 1]]
---
  def new
    @reply = @poll.replies.build
    @poll.questions.each do |question|

INSERT INTO "replies" ("poll_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["poll_id", 1], ["created_at", "2015-11-10 16:32:35.368093"], ["updated_at", "2015-11-10 16:32:35.368093"]]
---
  def create
    @reply = @poll.replies.build(reply_params)

    respond_to do |format|
      if @reply.save

SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_poll
    @poll = Poll.find params[:poll_id]